[
  {
    "name": "Bedroom furniture",
    "id": "Bedroom_furniture",
    "heading_level": 2,
    "hierarchy": [
      "Bedroom furniture"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "The most essential piece to a bedroom is the bed. Once you've placed a bed, you can start decorating your bedroom with furniture. Dressers, desks, and bookshelves are the basic furniture you can put in your bedroom."
      },
      {
        "type": "paragraph",
        "text": "To make a barricaded door or window, use signs and put them against doors or windows as pieces of wood then type dashes on."
      }
    ]
  },
  {
    "name": "Dressers",
    "id": "Dressers",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Dressers"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "A dresser is a stack of double chests. An idea for a more interesting home is to have themed chests with only certain things (e.x. Only store armor in the dresser). You can place item frames next to the dressers to show the items inside. Craftable clothing isn't available in Vanilla Minecraft, so most players put armor in their dressers. If this is the case, place a few armor stands down to show off your newly crafted armor."
      },
      {
        "type": "paragraph",
        "text": "If you don't want to waste wood on chests/need dressers for a real purpose, but still want them for decoration, you can make a dresser that looks like real life, but is not functional in Minecraft, and does not cost much wood, as it is made of wood planks. Place two wood planks next to each other on the floor, and place two above that. Then, put trapdoors, buttons, or signs with the letter O on all 4 blocks."
      }
    ]
  },
  {
    "name": "Closets",
    "id": "Closets",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Closets"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Here is a design for a cool and interactive closet that is simple to make. You will need:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "4 stairs",
          "2 doors",
          "2 trapdoors"
        ]
      },
      {
        "type": "paragraph",
        "text": "Place the blocks like this (the grid is from the side view):"
      },
      {
        "type": "paragraph",
        "text": "Then, place the doors over it so they look like the double doors, with the handles closest to each other. You could also add trapdoors either side of the stairs."
      }
    ]
  },
  {
    "name": "Cabinets",
    "id": "Cabinets",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Cabinets"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Here is how to make a simple cabinet."
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 of any type of block (bookshelves are preferable, because it gives the illusion of food or dinnerware within.)",
          "2 trapdoors"
        ]
      },
      {
        "type": "paragraph",
        "text": "Place the block against a wall. Then, place one trapdoor on top of the block and one on the front side. If desired, place multiple blocks with trapdoors next to each other, for a bigger cabinet."
      },
      {
        "type": "text",
        "text": "Layer 1"
      },
      {
        "type": "text",
        "text": "Layer 2"
      }
    ]
  },
  {
    "name": "Bunk Bed",
    "id": "Bunk_Bed",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Bunk Bed"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "For the bunk bed, you need a wall that has at least a width of 4 and a height of 4."
      },
      {
        "type": "paragraph",
        "text": "Get fences and place them each on the outer rim of the wall, and then place wood planks in the wall spaces on the bottom only. Place a bed on top of the two blocks. Next, get rid of the blocks under the bed and then place a bed where those blocks were. However, note that the top bed will not change your spawn point unless there is a solid block with two empty blocks above it one block below the bed and directly adjacent and you will wake up on top of the bed, so there needs to be more than one block of space above the bed."
      },
      {
        "type": "paragraph",
        "text": "You can also make a bunk bed with two doors and two beds. Put two blocks of any type in a row, and then place a bed on top. Break the two blocks. Then, place a bed under the top bed. Finally, put the two doors on the side."
      },
      {
        "type": "paragraph",
        "text": "This final design for a bunk bed requires a wall that is 3x3, and you will need 6 fences and 2 beds. First, place two stacks of fences, 3 blocks high each, with 2 blocks in between them. Then, place the first bed on the floor, the second on the 3rd fence, and you're finished!"
      }
    ]
  },
  {
    "name": "Bookshelves",
    "id": "Bookshelves",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Bookshelves"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a bookshelf, stack as many bookshelf blocks as you desire. You can also use slabs and stairs stacked on top of each other to simulate normal shelves. The back of looms can be used to look like empty shelves amongst the books. This design is simple, but pretty!"
      },
      {
        "type": "paragraph",
        "text": "If you want it to be really simple:"
      }
    ]
  },
  {
    "name": "Shelves",
    "id": "Shelves",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Shelves"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/2/2e/Aquarium_Decoration.png/revision/latest/scale-to-width-down/180?cb=20200226073604",
            "alt": "Aquarium Decoration",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "An Aquarium"
      },
      {
        "type": "paragraph",
        "text": "To make a shelf, place a row of 4 wood planks on the ground, and add a stack of 3 wood planks at each end. Close off the space at the top with 2 more planks. Finally, add slabs in the middle of all of the wood planks to simulate shelves."
      },
      {
        "type": "paragraph",
        "text": "You can make a modern shelf by placing carpet on top of one another."
      }
    ]
  },
  {
    "name": "Potted plant",
    "id": "Potted_plant",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Potted plant"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/8/88/Plant_Vase.png/revision/latest/scale-to-width-down/180?cb=20200226073200",
            "alt": "Plant Vase",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "A plant vase using bamboo and jungle leaves."
      },
      {
        "type": "paragraph",
        "text": "Note: As of Java Edition 1.4.2, there are now flower pots made out of three bricks crafted the same way as a Bucket, making this method not quite as useful. However, this method still remains useful for 2-block high plants, as they can't be placed into flower pots."
      },
      {
        "type": "paragraph",
        "text": "If you don't want to use a flower pot, either for the reason that you want to have a 2-block high plant in your pot or just a different type of flower pot, read on."
      },
      {
        "type": "paragraph",
        "text": "Place a grass block. You may also get a long grass, a rose, a yellow flower, or any of the other new 1-block-high plants."
      },
      {
        "type": "paragraph",
        "text": "Next, dig out the blocks around it on the floor."
      },
      {
        "type": "paragraph",
        "text": "Above each hole, place a trapdoor. Then make them all in the closed position, with its flat side against the side of the dirt block. After that, fill in the holes. Then put dirt or a stone block, tall grass piece, or fern on top of the dirt block and you're done!"
      },
      {
        "type": "paragraph",
        "text": "Another way to make potted plants is to put signs around a block of dirt as the pot and then put a plant on top of it."
      },
      {
        "type": "paragraph",
        "text": "You can also do this:"
      }
    ]
  },
  {
    "name": "Desks",
    "id": "Desks",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Desks"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a desk, take your choice of support, (Fence or fence gate look the best) and place 2 of them for a freestanding desk, 1 for a desk attached to the wall. Then make a surface (wooden slabs work well). Pressure plates or carpets can be also placed on fences, creating a much flatter surface. Additionally, if three fence blocks are placed in a row, two could be covered in pressure plates, and one with glowstone or a redstone lamp on top, making a \"lamp\"."
      },
      {
        "type": "paragraph",
        "text": "Another neat way of making easy and simple desks is to have a set of pistons lined up in patterns in rectangular shapes or lines. Simply place redstone blocks in the shape of your desk one block beneath your floor. Then place pistons atop the blocks for a permanent desk/table. Another way to make a desk is after the pistons are placed, put a single redstone torch under each one of them, causing the pistons to activate, and thus making a quick and simple table. An adaptation of this is to put a piston in the ground facing up and put pressure plates around it. When you walk up to it, the table/desk pops up."
      },
      {
        "type": "paragraph",
        "text": "A different way of making desks is to make a huge table out of blocks. There should be four \"leg\" blocks, acting as the \"legs\" of your table. On top of the \"legs\" you can put slabs or blocks, making a simple table. This form of table is one of the easiest to make."
      },
      {
        "type": "paragraph",
        "text": "The last type of table is the \"Block-by-block\" table. It consists of a simple arrangement of multiple blocks. By putting many blocks in a rectangular, square, or straight pattern, you can make a simple table useful for keeping things on. This form of table is mostly built with white, plain wool, because it causes the table to look like the table is covered with a clean, white tablecloth."
      },
      {
        "type": "paragraph",
        "text": "Another way to make a good looking desk is to place two upside down stairs on the ends with slabs between them, the stairs act as the legs. And if you want to have a top table cloth but still a wood table then put white carpet on top of the wood blocks."
      }
    ]
  },
  {
    "name": "Computers",
    "id": "Computers",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Computers"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Place an iron block, a painting on the side, and a \"keyboard\" in front of it. Some people use a powered minecart rail, mostly because it looks like there's buttons on it in the original resource pack. Best use with a desk. Some people put an item frame with an apple on the back to brand it as an Apple iMac! You can use 3×2×1 logs and put the \"computer\" in the middle. Alternatively, there are several mods that can provide you with computers. A good example is ComputerCraft or the Mr. Crayfish's furniture mod."
      },
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/1/16/Computer_In_Room.png/revision/latest/scale-to-width-down/180?cb=20210208042937",
            "alt": "Computer In Room",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "Basic Computer on a desk with a chair."
      },
      {
        "type": "paragraph",
        "text": "Another way is to place a painting on the wall in front of a block of wood and place a minecart rail or another object that looks like a computer keyboard and you can use that as a computer. When you want to 'change the display' just put a new picture in place. A really good way of making a keyboard is digging a one block deep hole, and then putting a carpet on it. Then, put two armor stands facing forward on the left and right side of the hole. Using pistons, push the armor stands into the hole. Now push a quartz block downward repeatedly (again, using a piston) until it reaches ground level. There you have it, a keyboard."
      },
      {
        "type": "paragraph",
        "text": "Another way to make a computer is by placing a wooden or stone pressure plate. From the outside (or rear of the 'desk'), place a sign on the edge of the pressure plate (check for the black outline showing the plate as selected). This sign can be decorated with common logos, like real monitors. Now, move to the front of the 'desk' (or back of the sign, which is now floating) and place a picture. An optional button can be placed on the left or right as a mouse. Two of these screens can be setup (the pressure plate is required to hold the sign) for dual monitor configurations."
      },
      {
        "type": "paragraph",
        "text": "Alternatively, you can use the item frame method to set up a computer. Place an oak wood block next to the wall. Above it on the wall put an item frame. On the wood block, put a stone pressure plate and there you have it! You can put a map or an item (heads are good ones) inside to make it look like you are running a program. You can also expand by putting another block of wood on one side of the first one and placing a empty flower pot on one and a button of any type on the other. You now have a laptop with some coffee and a mouse!"
      },
      {
        "type": "paragraph",
        "text": "To make a disk drive, place a jukebox close to a wall and place a stone or wooden pressure plate on the jukebox. Add a picture on the wall and then place any block beside the jukebox and place a lever on it. Now you have a computer that can play music!"
      },
      {
        "type": "paragraph",
        "text": "Griefer's trick: Add a TNT trap with a dropper and a wooden pressure plate hidden and a trapdoor to open the computer system and add a book to the dropper. You can use them as 'viruses' to wreck their computer. Add a button next to the dropper to turn it 'on'. Add a command block next to the pressure plate “hidden” and set the command to: /me ERROR! VIRUS ERROR!. When a player has turned 'on' their computer, the ERROR! alert will make the player think there is a virus and then the computer will explode!"
      },
      {
        "type": "paragraph",
        "text": "One way is to put a block of any kind with a painting on. Underneath put a pressure plate as a keyboard and use stairs as a desk chair. There are many other ways that you can make them please comment below to help other players! :)"
      }
    ]
  },
  {
    "name": "Lamps or light sources",
    "id": "Lamps_or_light_sources",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Lamps or light sources"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Using a redstone lamp is the easiest way to create a toggle-able light source. Alternatively, you can use one of the following methods:"
      },
      {
        "type": "paragraph",
        "text": "To make a lamp, place a fence block and put a torch (or some glowstone) on top. it can also work with a cobblestone wall or end rod."
      },
      {
        "type": "paragraph",
        "text": "One method to create a side table-looking light is placing a glowstone, sea lantern, redstone lamp or other full-block light source on your floor, and put a trapdoor on each side. Or you could put lights behind paintings as well."
      },
      {
        "type": "paragraph",
        "text": "Another method is making an invisible lamp, by placing your preferred light source in your floor and cover it with a carpet, which doesn't block the light."
      },
      {
        "type": "paragraph",
        "text": "Or, to make a different kind of lamp, build up three blocks from your original ceiling, place glass where the original ceiling was and leave one block open for an escape hatch and start placing lava. This would be best used in creative mode in a netherrack/nether bricks structure (creative mode because depending on how big your house is it might take a lot of lava to cover the ceiling!)"
      },
      {
        "type": "paragraph",
        "text": "Mood lighting can be made by placing a glowstone block and shield it on all sides but one. Next, place a slab in the remaining spot. The result is a small patch of slightly whiter light. This will not create a radius of light however, so it's solely for the effect."
      },
      {
        "type": "paragraph",
        "text": "A modern/futuristic style light can be made by placing down any block and then a stone slab (or any half-step) on top. Then remove the bottom block and put another half step in its place. Put a glowstone block on top of all of it. It should look like the glowstone hovers above the stone slabs."
      },
      {
        "type": "paragraph",
        "text": "Another modern way is to have a wall with stairs on all of the bottom row of blocks but the corners, and place glowstone in the corners. Then place one more stair piece next to the glowstone to make an 8×8 pixel square of glowstone. Lastly, place a half slab of the same type of the stair (wood plank, cobblestone, stone brick, sandstone) on the glowstone. There you have a modern 'glowing' couch piece. I recommend either stone brick (modern) or sandstone (blends in with glowstone)."
      },
      {
        "type": "paragraph",
        "text": "Using lava as lighting can create a cool effect. Place a non-flammable block on the ground. Place a block next to that, and place glass on there, before removing the second block you placed. Do this on all sides, before placing any amount of layers of glass on top of the glass. Pour lava down the resulting tube, and place a non-flammable block on the top. Another way (This is best for dungeons) is to place lava and put iron bars in front of the lava (This may not work in 1.13 because of updated water physics). Note: This is dangerous if anything within four blocks of your lava lamp is flammable. Not recommended for houses with lots of wood/wool."
      }
    ]
  },
  {
    "name": "Curtains",
    "id": "Curtains",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Curtains"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Curtains can be useful for the sides of bathtubs, or just as decoration anywhere. Attach a row of blocks under your ceiling, and then attach vines to the sides. The vines will grow hanging down, and create curtains for you."
      },
      {
        "type": "paragraph",
        "text": "Another alternative is to use wool. Just make a small wall of wool in front of your window or open space, and privacy is perfect!"
      },
      {
        "type": "paragraph",
        "text": "Also, as of version 1.8, you can use banners as curtains. First, make a banner. The color and design are up to you, but a plain white banner is good with many homes. Next, you must put up the banner. For one block high windows, place the banner on the block above it. If the window is two blocks high, place the banner on the higher glass block of the two. For three or more, place banners on every row except the bottom one. This design makes a nice hanging curtain that lets light in and can easily be removed."
      },
      {
        "type": "paragraph",
        "text": "Ladders and or trapdoors could also be used as open window shutters."
      }
    ]
  },
  {
    "name": "Other furniture",
    "id": "Other_furniture",
    "heading_level": 3,
    "hierarchy": [
      "Bedroom furniture",
      "Other furniture"
    ],
    "category": "Bedroom furniture",
    "subcategory": null,
    "parent_section": "Bedroom furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "It's a good idea to add a crafting table to your bedroom, and possibly a jukebox. Crafting tables and jukeboxes already exist in the game, so there is no need to build them differently. You can also make mini-tree from a leaf block on a fence block."
      }
    ]
  },
  {
    "name": "Closets",
    "id": "Closets_2",
    "heading_level": 2,
    "hierarchy": [
      "Closets"
    ],
    "category": "Closets",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a closet, first, dig two blocks tall and one block wide into a wall. If you want to make it wider, dig in deeper and start to dig spreading out. Then, go outside of the little \"room\" you've made and put a door at the entrance. You can make a four by four entrance but you will have to put double doors. Since you cannot really \"place\" armor in the game (except in 1.8, if you use an armor stand), you must use a chest and put the chest into the closet, or if you still want to be able to see the armor put up a row of item frames with the armor inside."
      }
    ]
  },
  {
    "name": "Living room furniture",
    "id": "Living_room_furniture",
    "heading_level": 2,
    "hierarchy": [
      "Living room furniture"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "The living room is your house's heart, where you can gather with friends (if you're on a server) and spend your time, if you want to."
      }
    ]
  },
  {
    "name": "Tables",
    "id": "Tables",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Tables"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Tables are an essential furniture item in every living room. Read on to find out how to make many different table designs!"
      }
    ]
  },
  {
    "name": "Coffee table",
    "id": "Coffee_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Coffee table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To create a coffee table, use any type of slab and place them near your sofas, chairs, etc. To make a mug, try a flower pot with nothing in it. As part of the new 1.13 update, sea pickles will work as mugs too. You can also place multiple sea pickles on one block."
      }
    ]
  },
  {
    "name": "Corner table",
    "id": "Corner_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Corner table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Build a fence and add a wooden pressure plate, carpet/rug or trapdoor on top for a good looking table. Another option is to place a piston in the ground with a redstone torch or block below it. The piston will activate, and will create a nice, one block table."
      }
    ]
  },
  {
    "name": "Dining room table",
    "id": "Dining_room_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Dining room table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "You could also try the piston table. The piston table looks cool with a cake on it! Again, some crafters believe that slab floors will make the table more aesthetically pleasing."
            ]
          },
          "Another method utilizing stair blocks: Place stairs upside-down, and back-to-back. This table can be as small as 2 back-to-back stairs or as large as you like! Slabs and stairs can be used as chairs.",
          "Place four blocks (e.g., wood planks) for the legs of your table. Then place some upside down slabs in the center of the four legs you just created. Next, place four upside down slabs between the legs to make an awesome table.",
          "Place a dark block (e.g., such as nether bricks) in a 3×2 hole in your floor. On top of your dark blocks, place glass blocks.",
          "For larger tables, you can place stone pressure plates or white carpet to serve as dishware. You can use empty flowerpots for cups and/or a chest with prepared food in the middle of the table, too!",
          "For a simple table, with an actual use, simply use fence posts against your wall, then put wooden pressure plates on top. Once that is done, simply replace the blocks on the wall right above the table (on the same level as the pressure plates) with droppers (dispensers work too, but require a bow to make, unlike droppers). Now, fill the droppers with food, and then all you have to do is walk up to the table, and voila! you have food.",
          "In later versions you can have fence posts over the whole area of the table and cover them with carpets.",
          "For plates, you can use item frames (if your tabletop is made out of solid blocks) and put any item of food in them that you like."
        ]
      }
    ]
  },
  {
    "name": "Modern table",
    "id": "Modern_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Modern table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Place two glowstone blocks where you want the center of your table to be, then surround the glowstone blocks with glass panes for a cake and coffee table that will light up your living room! You can also make some more rings of glowstone around the middle glowstone block."
      },
      {
        "type": "paragraph",
        "text": "You can also make a modern table with some carpet, stairs and fences by placing the carpet on top of a fence and then putting the stairs of your choice down in the places you would like it for the seats."
      }
    ]
  },
  {
    "name": "Piston table",
    "id": "Piston_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Piston table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Extended pistons are usually more aesthetically pleasing than fences with pressure plates, as they form a solid top, rather than one with gaps. You need 6 pistons and 6 redstone torches. Dig the floor 3×2×2 and then fill just one layer of the hole with redstone torches."
      },
      {
        "type": "paragraph",
        "text": "Side view"
      },
      {
        "type": "paragraph",
        "text": "Overhead view"
      },
      {
        "type": "paragraph",
        "text": "Then just cover the hole with pistons (or you could place a sticky piston at random to make it look as though someone spilled) facing upward. The piston table is completed."
      }
    ]
  },
  {
    "name": "Simple table",
    "id": "Simple_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Simple table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Place 2 blocks above where you want your table, now create a 2 block deep hole below the blocks above your table (3 if you include the gap for the table which should already be there), get into the hole, look up and place 2 stairs facing each other on the bottom of them, get out the hole and fill it in, now remove the 2 blocks above the table, you now have a nice simple table."
      },
      {
        "type": "paragraph",
        "text": "Note: Remember to fill the hole."
      }
    ]
  },
  {
    "name": "Tablecloths",
    "id": "Tablecloths",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Tablecloths"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Using carpet blocks, you can replace the pressure plates on tables with carpet, or perhaps top your piston arms with the aforementioned block. This will create a nice-looking tablecloth. Use it anywhere, from fancy restaurants to cave homes!"
      }
    ]
  },
  {
    "name": "Stone age table",
    "id": "Stone_age_table",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Tables",
      "Stone age table"
    ],
    "category": "Living room furniture",
    "subcategory": "Tables",
    "parent_section": "Tables",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "This table is simple, yet looks glorious on medieval structures or mansions. Start by putting a cobblestone slab at the top, and surround it with upside-down cobblestone stairs- don't forget to destroy the corners after. in the middle, put a flower pot and plant it with your favorite flower (Allium or Azure bluet recommended). Make chairs and put iron pressure plates on top of cobblestone stairs. Enjoy!"
      },
      {
        "type": "text",
        "text": "Layer 1"
      },
      {
        "type": "text",
        "text": "Layer 2"
      }
    ]
  },
  {
    "name": "TV",
    "id": "TV",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "TV"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "There are two main designs for televisions in Minecraft. You can make a decorative TV that is really just coal blocks, black wool, or obsidian decoratively in or on the wall or floor. You could also just use a 2×1 painting starting from left to right to imitate a flat-screen TV. You can also put two blocks of any material, two fences up top and a 2×1 painting on the fence."
      },
      {
        "type": "paragraph",
        "text": "Another possible design is using a 4x2x1 space. The TV is made by placing 4 blocks of Black Concrete, Coal Blocks, Obsidian, or another black block in a 2 blocks high, 2 blocks tall shape and putting 2 note blocks or jukeboxes on either side of it."
      },
      {
        "type": "paragraph",
        "text": "A more expensive method is by putting a redstone lamp in the wall with a lever next to it, and a painting over the lamp. When the lever is pulled, light will shine through the painting."
      },
      {
        "type": "paragraph",
        "text": "Another design is to place two furnaces at the bottom, two obsidian on top, and a 2×1 painting in front where you want the screen, then place two iron blocks vertically across the sides and place a button on each one."
      },
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/07/Minecraft_Chair_Designs.png/revision/latest/scale-to-width-down/180?cb=20210806233925",
            "alt": "Minecraft Chair Designs",
            "title": ""
          },
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/0/07/Minecraft_Chair_Designs.png/revision/latest/scale-to-width-down/180?cb=20210806233925",
            "alt": "Minecraft Chair Designs",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "Five Basic Chair Designs made from oak. From left to right: Arm Chair, Study Chair (with item frames), Dining Chair (with oak signs), Sofa, and Lounge Chair."
      }
    ]
  },
  {
    "name": "Sofa and chairs",
    "id": "Sofa_and_chairs",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Sofa and chairs"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f7/More_Minecraft_Chair_Designs.png/revision/latest/scale-to-width-down/180?cb=20210806235054",
            "alt": "More Minecraft Chair Designs",
            "title": ""
          },
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/f/f7/More_Minecraft_Chair_Designs.png/revision/latest/scale-to-width-down/180?cb=20210806235054",
            "alt": "More Minecraft Chair Designs",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "More Chair Designs. From top left clockwise: Sitting chairs (4 of them), low chair, bar chair, piano chair, \"sofa\" made from warped items and two cyan beds, and a orange sofa set."
      },
      {
        "type": "paragraph",
        "text": "A sofa can be made using 2-4 stair blocks, with a sign attached to either side as \"arms\". Also, as of Java Edition 1.4.2, one could use stairs facing inward to create \"arms\". An alternate type of sofa can be made by placing 2 or more slabs in a row and surround the sides and back with blank signs. To make a 'leather' sofa, use slabs surrounded by wool blocks."
      },
      {
        "type": "paragraph",
        "text": "Another way to make a nice couch is to place four wood planks in a row, with wood slabs on top. Then, put two wood planks on the ends and two rails in the middle. Place minecarts on the rails, and there! You have a couch you can actually sit on!"
      },
      {
        "type": "paragraph",
        "text": "Chairs can be made similarly to sofas, but the 'sitting' area is only 1 block wide. There are many variations of the chair listed below. You could just place 1 stair block for a simple chair. You could also put 1 stair block down, and put blank signs on the side for an armchair. You could also put down 1 slab, with blank signs on the sides and the back for a cool-looking armchair."
      },
      {
        "type": "paragraph",
        "text": "If you have a dog (tamed wolf), you may also want a dog bed in your house for it to sit on. You can make one using 2 wood slabs in a row, with signs attached on the sides, front and back. Also, since the 1.6.1 update, place 2 carpet color of choice on the ground."
      },
      {
        "type": "paragraph",
        "text": "A throne can be made by placing a minecart track on the ground with a block (stone, cobblestone, or iron blocks are best) on one end and a staircase on the other end. placing another block on top of the first and one on either side of it. Then, four stairs are placed to the sides of the minecart track and the original staircase. Then, place two stairs on the two side blocks. Put a minecart on the track and enjoy the throne you can sit on."
      },
      {
        "type": "paragraph",
        "text": "A step up into the modern world of interior design is the \"lounge bench\". Make an extra-long \"sofa\" with a 90-degree angle in it somewhere, no sign \"arms\", and possibly using slabs and blocks, instead of stair pieces. If in a corner, a bookshelf looks appealing in the corner, and blends in with the wood's texture. You can also place any type of stairs (oak wood stairs are recommended) and place blocks on the sides."
      },
      {
        "type": "paragraph",
        "text": "Another model looks like a sofa from a TV show. You are required to have 3 height, 2 length and 6 width. You can use spruce wood or brown wool to make it look like that TV show sofa, but you have to have 26 blocks of that material. Any material is okay, but otherwise, it will not look like the prototype. First, lay 12 blocks of your material in a 2×6 rectangle. Then add your material to ½ of your sofa (width). Then, on the ends of where there is 1 layer of material, add 1 block to each end. Now just add 6 blocks on top of the 2 block height area (other than the ends and add 1 block on each. Never set near fires, as the sofa will burn up."
      },
      {
        "type": "paragraph",
        "text": "You can also make a working chair, using a minecart, rail, stair, 2 signs, any full block, a piston, and a lever. First place a piston 2 blocks above where you want your chair to be (facing down) and place a lever on the side of it, next place a full block with a rail on it where you want your chair to be, then place a minecart on the rail and break the block below the rail, after that place a stair where the rail was, finally activate the lever, it should push the stair block into the minecart, now break the piston and lever and place signs on the sides of the chair. To make a cool desk chair you could use a Red Nether Brick Slab instead of a stair, spruce or dark oak trapdoors instead of signs and 2 more trapdoors behind the chair as the back, and a red banner on the top back trapdoor hanging into the seat (you could also make a working a couch using this method). IMPORTANT: if you touch the chair while moving, it could mess up the minecart. there are 2 ways to fix this, the first is taking apart the chair and repeating these steps, the second can also also prevent this but requires cheats, for the second one you can either enter the command: /tp @e [type=minecart,c=1] (replace this with the coordinates of the chair) facing (replace this with the coordinates 1 block to the left or right of the chair), or place a repeating command block under the chair set to 600 ticks in delay and always active with the same command as before. Ex. if your chair is at coordinates 176 85 293 and facing north then the command is: /tp @e [type=minecart,c=1] 176 85 293 facing 176 85 294(Note: the last number could be 294 or 292)."
      }
    ]
  },
  {
    "name": "Fireplace",
    "id": "Fireplace",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Fireplace"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Fireplaces give your living room a more \"homey\" feel. A fireplace can literally be a little hole in the wall with netherrack in it. Or it can be a sleek, ultra-modern piece of contemporary Minecraft art."
      },
      {
        "type": "paragraph",
        "text": "For the actual fire, the simplest option is to simply use a campfire. This has the right appearance and has the useful function of cooking food without fuel, while also not igniting nearby blocks. Campfires can still damage mobs that touch them, so make sure that nothing can get to them. The alternatives are burning netherrack, lava or even an operating furnace."
      },
      {
        "type": "paragraph",
        "text": "A nice design is a brick outline in the wall and floor (slabs can make the area around it on the floor elevated). Then make a 1×2×1 hole in the wall inside the brick outline and put in a campfire/netherrack. Light the netherrack (if going with this option), and add a chimney for all the smoke to go out through (and it's also an outside decoration!) A more contemporary and \"sleek\" design is to make the same brick outline but with lava inside, and put glass in front of the lava, making for an ultra-modern, \"artificial fireplace\" feel. Iron bars can be added around the fire to look like a fire guard for a more realistic look."
      },
      {
        "type": "paragraph",
        "text": "For an alternate fireplace design, pick a spot away from any flammable material. Next, dig a 1 block deep hole (2 blocks if using netherrack) and put the fire in it. Next, you should place a glass block on top of the fire so you won't burn yourself (you will have to put a block adjacent to the hole to place the glass block then later remove it). Put chairs and/or couches surrounding this and you have yourself a fire pit and lounge."
      },
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/44/Minecraft_Fireplace.png/revision/latest/scale-to-width-down/140?cb=20210208052503",
            "alt": "Minecraft Fireplace",
            "title": ""
          },
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/4/44/Minecraft_Fireplace.png/revision/latest/scale-to-width-down/140?cb=20210208052503",
            "alt": "Minecraft Fireplace",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "An example of a traditional fireplace. The wooden blocks seen behind are flammable, and are in reach as well as some of the ceiling blocks. These are well in the fire range so be careful where the wood is located."
      },
      {
        "type": "paragraph",
        "text": "To build an old-style brick built fireplace, you will want this next to a wall. First, dig a 3 block deep hole. After that, add netherrack at the bottom and light it up. Third, place netherrack on the top of the hole. Next, place a brick on both sides of the fire and put another brick on top of those and in the middle of the ones in the top. Repeat in front of the bricks so you cannot throw things in the fire. This part is optional. If you want to add a chimney, add bricks on the top to the sides and the front of the fire. Keep adding until you reach your roof and then break the area where the fire is. Add 2 - 3 more levels of the chimney on the roof. Finally, add netherrack on your roof level and light it up!"
      },
      {
        "type": "paragraph",
        "text": "Alternatively, you can build a traditional style fireplace, which is similar to the old-style fireplace but more elaborate. Simply make a 5×2 floorspace from cobblestone, and replace the center-back block with netherrack (or put a campfire on top of this block). Next, place a 3-high column of stone bricks on each side of the netherrack/campfire, and place stone brick stairs on each side (place them so that the steps go toward the center). Add a stone brick between the two stairs, and attach an additional stone brick below. Build up a column of stone bricks upward from the center brick, until it exits the house, placing a torch on top to imitate a chimney stoke. Finally, ignite the netherrack and add nether-brick fences around the opening. You could also add stone stairs to the underside of the opening. See the image for reference."
      },
      {
        "type": "paragraph",
        "text": "IMPORTANT: If you're not using a campfire, wood blocks and stairs will ignite if they are less than 4 blocks above the fire or any adjacent blocks. You can turn off fire spreading with the command: /gamerule doFireTick false, but if fire is ignited (by player, lighting etc.) on a flammable object, it will burn forever unless you stop it. However, the rest of your house will be fine."
      },
      {
        "type": "paragraph",
        "text": "Make a huge fireplace 3×3 with a campfire/netherrack, and then add a fence at the side (it'll need to be a nether brick fence if you're using netherrack) and progress it to the center. It should be 3 blocks from the ground. Now, descend it to almost the fire level (2 blocks away) and add a cauldron to the nether brick fence. Add water in and it's done! Fun if making witch houses."
      },
      {
        "type": "paragraph",
        "text": "Automatic fireplaces activate at the push of a button or the pull of a lever. There is a glitch that lets fire charges go through a 1-meter wide wall when shot out of a dispenser. Make a wall out of non-flammable material. Leave a 3 space gap. Then make another wall. In the gap, put a single block located right beside where you want the dispenser. Place a dispenser so it is facing the inside wall and there is no space between the dispenser and the wall. Place redstone on the block that leads to the dispenser [you have to use a repeater]. Start building the inside. You need to surround a piece of netherrack with iron bars. Make sure the floor is not made out of any wooden materials, wool or carpets as they will burn. You may decorate this any other way but place a button where the redstone signal would receive the input. Then, place multiple fire charges in the dispenser [they don't have any other important use]. You will have to kill blazes and creepers/ghasts and mine coal or kill wither skeletons to make them so they are hard to make but are worth the trouble."
      },
      {
        "type": "paragraph",
        "text": "For a more effective fireplace, place a sticky piston that is activated by a NOT gate. Replace the button with the lever. You may need to use repeaters to delay the dispenser. When you switch the fireplace off, a piston pops out and burns out the fire. You may want to make a fake chimney to hide the piston."
      },
      {
        "type": "paragraph",
        "text": "For a unique look to your fireplace, use a dispenser to dispense burning arrows to make the fire look better. You will need some redstone skills to make this."
      },
      {
        "type": "table",
        "rows": [
          [
            "A",
            "",
            "",
            "",
            "",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Fireplace with burning arrows. A indicates a redstone clock and an"
      },
      {
        "type": "text",
        "text": "AND gate"
      },
      {
        "type": "text",
        "text": "."
      },
      {
        "type": "paragraph",
        "text": "This shoots flaming arrows to give a multilayered experience."
      }
    ]
  },
  {
    "name": "Shelves",
    "id": "Shelves_2",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Shelves"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Building a shelf is simple. all you need to do is place a trap door where you want your shelf to go, and you're finished!"
      },
      {
        "type": "paragraph",
        "text": "You could also place slabs on a wall. That way you can put things on them, such as a cake."
      },
      {
        "type": "paragraph",
        "text": "Placing stairs upside down allows functional stair shelves. Blocks are split into two halves (thus two slabs of the same material make 1 block) so point your cursor at the TOP HALF of the block you want your shelf against and place your stair; if you aim lower it will be right-side-up and you have to replace it. If you aimed for the top half of the placement block it will become upside-down and you can make non-floating cake holders. This way you can skip the trouble of placing a block and your stair and removing the reference block. Place them outside under a window for a windowsill, or maybe even use several with crafting tables mixed in for a cat tree."
      }
    ]
  },
  {
    "name": "Ceiling fan",
    "id": "Ceiling_fan",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Ceiling fan"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Place any block on the ceiling, then put 4 trapdoors on each side of the block to give it the look of a ceiling fan."
      }
    ]
  },
  {
    "name": "Piano",
    "id": "Piano",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Piano"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Need some music in your house? Here's how to make a piano that plays music or just notes."
      },
      {
        "type": "paragraph",
        "text": "All you need is:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2 Nether brick stairs",
          "1 Note block",
          "1 Jukebox",
          "Several Music discs"
        ]
      },
      {
        "type": "paragraph",
        "text": "Now to the building:"
      },
      {
        "type": "list",
        "style": "ordered",
        "items": [
          "Dig a 2x4 hole in the ground.",
          "Put a note block and a jukebox in the hole.",
          "Put two upside-down nether brick stairs on the note block and on the jukebox (or put black and white carpets on 2 quartz stairs).",
          "Now you have your fully functional piano!"
        ]
      }
    ]
  },
  {
    "name": "Concert piano",
    "id": "Concert_piano",
    "heading_level": 4,
    "hierarchy": [
      "Living room furniture",
      "Piano",
      "Concert piano"
    ],
    "category": "Living room furniture",
    "subcategory": "Piano",
    "parent_section": "Piano",
    "content_blocks": [
      {
        "type": "list",
        "style": "ordered",
        "items": [
          "Put down a fence and black wool.",
          "Behind the first piece, put another and one to the right of it. On the right piece, put another fence.",
          "Do that one more time but do three wool pieces.",
          "Put quartz stairs facing you (3 of them).",
          "Put down two of any block as a bench."
        ]
      },
      {
        "type": "paragraph",
        "text": "or"
      },
      {
        "type": "list",
        "style": "ordered",
        "items": [
          "Put down two blocks of black wool next to each other.",
          "Then on the left of these blocks place three blocks of black wool one in front of the other.",
          "Next on top of the first two blocks you placed, place two more blocks.",
          "After that on top of all of your black wool place black carpet.",
          "On the second three blocks you placed, place another layer of carpet on those three blocks.",
          "In front of the first two blocks of black wool you placed, place two blocks of note blocks next two each other.",
          "Then do the same on top of it",
          "In front of those blocks place two blocks of nether brick stairs"
        ]
      },
      {
        "type": "paragraph",
        "text": "or The Grand Piano (By Sky_Ninja99)"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Note: all the blocks used in this are nether brick",
          "Symbols: n: nether brick, s: stair(| means north to south[the stair part; [ means south to north), l: slab, u: upside-down slab, f: fence, t: track, p: stone slab, 0: air, c: chest with jukebox under it",
          "Design:"
        ]
      },
      {
        "type": "paragraph",
        "text": "North"
      },
      {
        "type": "text",
        "text": "0f00 0n00 0|00 0000"
      },
      {
        "type": "text",
        "text": "uuu0 npn0 0ul0 l000"
      },
      {
        "type": "text",
        "text": "uuuu nppn 00ul ul00"
      },
      {
        "type": "text",
        "text": "uuuu n||n f0ul nl00"
      },
      {
        "type": "text",
        "text": "fuuf [tt[ 0000 0000"
      },
      {
        "type": "text",
        "text": "c000"
      },
      {
        "type": "text",
        "text": "0ll0"
      },
      {
        "type": "paragraph",
        "text": "Notes for the below diagram:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "The nether brick stairs indicate stairs going from north to south and the oak stairs (which should actually be nether brick stairs) are stairs going from south to north.",
          "The nether brick slabs indicate normal slabs and the oak slabs (which should actually be nether brick slabs) are upside down slabs.",
          "The chest has a jukebox under it."
        ]
      },
      {
        "type": "paragraph",
        "text": "North"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "And that's how it's made!"
        ]
      }
    ]
  },
  {
    "name": "Cool fences",
    "id": "Cool_fences",
    "heading_level": 3,
    "hierarchy": [
      "Living room furniture",
      "Cool fences"
    ],
    "category": "Living room furniture",
    "subcategory": null,
    "parent_section": "Living room furniture",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a \"cool\" fence, place a stair where you want your fence to go, then place a slab block on top of each stair. Glass panes, iron bars and cobblestone walls with slabs on top will also work."
      }
    ]
  },
  {
    "name": "Kitchen",
    "id": "Kitchen",
    "heading_level": 2,
    "hierarchy": [
      "Kitchen"
    ],
    "category": "Kitchen",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "A kitchen may consist of a small chest with food products, such as meats, bread, or raw ingredients. You may wish to add a crafting table as well as a few furnaces, to simulate a working area and an oven. Counters are made by placing the stone, stone brick, or wood plank blocks in any manner a real-world kitchen would be placed in. Also, the kitchen should be placed on cobblestone or stone brick floors, rather than wood plank floors. For a more fancy floor, use polished andesite and polished granite, or black and white wool."
      },
      {
        "type": "paragraph",
        "text": "You may also make a fridge by placing a dispenser on the floor, an iron block on top, and an iron door in front. Then just place a button next to the dispenser, and when you press it, the iron door will open, and the dispenser will dispense your food! If you have a slanted roof put a 2×1 hole in the ceiling near the wall and over the counter and put two stair blocks there and make it look like there are just two solid blocks there. Then, put a large chest underneath it and you got yourself a cabinet!"
      }
    ]
  },
  {
    "name": "Sink",
    "id": "Sink",
    "heading_level": 3,
    "hierarchy": [
      "Kitchen",
      "Sink"
    ],
    "category": "Kitchen",
    "subcategory": null,
    "parent_section": "Kitchen",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "A sink allows you to have a water supply right in your kitchen. Many sinks use a 2×2 square. You could also create a 1×1 block sink just for show, or a flowing sink. You can use a cauldron filled with water (or alternatively a hopper) and then, a lever (or tripwire hook) above it representing the tap. Putting iron blocks below or surrounding your sink would look cool, or gold or diamond blocks if you have the resources."
      },
      {
        "type": "paragraph",
        "text": "Materials Needed:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 cauldron or hopper",
          "1 lever or tripwire hook",
          "1 bucket of water if you use a cauldron (optional)"
        ]
      },
      {
        "type": "paragraph",
        "text": "1. Place the cauldron or hopper against the wall."
      },
      {
        "type": "paragraph",
        "text": "2. Place the lever or tripwire hook above the cauldron."
      },
      {
        "type": "paragraph",
        "text": "(Optional) Last, fill the cauldron with water from your bucket."
      },
      {
        "type": "paragraph",
        "text": "Cleaning sink"
      },
      {
        "type": "paragraph",
        "text": "After Java Edition 1.4.2, Minecraft added the ability where one could use the water-filled cauldron to remove any kind of dye from any kind of dyed leather armor. Right after Java Edition 1.8, in which banners were added, cauldrons got another use of removing the last pattern on a banner. Thus, this design is now useful."
      }
    ]
  },
  {
    "name": "Fridge",
    "id": "Fridge",
    "heading_level": 3,
    "hierarchy": [
      "Kitchen",
      "Fridge"
    ],
    "category": "Kitchen",
    "subcategory": null,
    "parent_section": "Kitchen",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "You can make a refrigerator for a nice finish, and to make your kitchen more distinguished. Many fridge designs allow you to store food inside them, making them functional as well as decorative."
      },
      {
        "type": "paragraph",
        "text": "Design 1"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 Chest",
          "1 Iron block (Quartz or Snow for alternate texture packs)",
          "1 Iron door",
          "1 Lever"
        ]
      },
      {
        "type": "paragraph",
        "text": "This fridge will look fancy and you will have the ability to store items. Firstly dig a block where you want to put your fridge, then put in there a chest, leave the above block blank. Put above the blank space an Iron/Quartz/Snow Block, then put an iron door and a lever above or next to it."
      },
      {
        "type": "text",
        "text": "Layer 1"
      },
      {
        "type": "text",
        "text": "Layer 2"
      },
      {
        "type": "paragraph",
        "text": "Design 2"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 dispenser",
          "1 iron block",
          "1 iron door",
          "1 button"
        ]
      },
      {
        "type": "paragraph",
        "text": "This fridge will give you food when you need some. Place a dispenser on the ground with an iron block on it (you could also place the dispenser on top of the iron block). Place an iron door in front of those and place a button on the iron block. When you press the button, the door will open and the dispenser will drop the food you stored. You can also use a dropper instead of a dispenser."
      },
      {
        "type": "text",
        "text": "Layer 1"
      },
      {
        "type": "text",
        "text": "Layer 2"
      },
      {
        "type": "paragraph",
        "text": "Design 3"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2 Iron blocks",
          "1 Button",
          "1 Dispenser"
        ]
      },
      {
        "type": "paragraph",
        "text": "This fridge needs to be built on a wall. To build it, dig one block into the wall. Place a dispenser in the wall, and from inside fill it with food. Place two iron blocks in a stack in front of it. Place a button on either side of the bottom block. When you press the button, instant food! Perfect if you need some food in a hurry."
      },
      {
        "type": "paragraph",
        "text": "Design 4"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 dispenser",
          "1 iron block",
          "1 iron door",
          "1 button or lever"
        ]
      },
      {
        "type": "paragraph",
        "text": "Place a dispenser and on top, put an iron block. Then, place an iron door in front of it, and put a button or lever on the iron block. Then just fill the dispenser."
      },
      {
        "type": "paragraph",
        "text": "Design 5"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "7 iron blocks",
          "3 sticky pistons",
          "2 Redstone torches",
          "1 lever",
          "8 (?) Redstone dust",
          "1 Block (any kind) to place some of the Redstone dust on",
          "1 ice block (Obtained in survival with silk touch or pushed into place with pistons)",
          "1 chest",
          "3 stone slabs"
        ]
      },
      {
        "type": "paragraph",
        "text": "To set up this fridge, make 2 wide and 3 tall rectangles out of the iron. Make sure it is against a wall and in a corner. On the side facing into the corner, cut out the walls and place the sticky pistons, setting up Redstone torches appropriately as inverters to the pistons. Then, attach the lever to the 2nd block up on the non-piston-attached side. Wire this lever into the piston inverters, and voila, a working fridge. inside the fridge, place an iron block in the middle, a stone slab as the roof, and put a chest in the top space. At the bottom, put a block of ice in as a sort of \"freezer.\""
      },
      {
        "type": "paragraph",
        "text": "Design 6"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "4 of any solid block",
          "1 rail",
          "1 Minecart with chest",
          "1 piston (not sticky)",
          "6-8 blocks of the material you want your fridge to be made of (I.E- iron or quartz)",
          "1 redstone torch or redstone block"
        ]
      },
      {
        "type": "paragraph",
        "text": "This is a good fridge that can make a tower, three blocks high, of any solid block. Now add another solid block in front of the three high stacks. Add a rail to it. Put a storage minecart on top of the rail. Destroy the block with the rail on it so that the minecart fawn. Add a piston on the top of the 'tower', facing down. Now, put the block underneath the piston that you want your fridge to be made out of (I.E- if you want an iron fridge, the block underneath the piston would be iron). Now put a Redstone torch/block on top of the tower. This will force the piston down. Destroy the piston, the tower, and the Redstone torch/block. You should be left with a block with a shading error. Add blocks around it so that you can't see the black… stuff. You now have a fridge!"
      },
      {
        "type": "paragraph",
        "text": "Design 7 by -metalmanII-"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2 dispensers",
          "Iron door",
          "2 buttons",
          "2 blocks of any kind (preferably iron blocks, you can use the blocks of your wall material if you are building this fridge into a wall)"
        ]
      },
      {
        "type": "paragraph",
        "text": "Instructions: place 2 dispensers one on top of the other, then fill with food."
      },
      {
        "type": "paragraph",
        "text": "Jump on top and place an iron door so it is touching the dispensers."
      },
      {
        "type": "paragraph",
        "text": "On either side place your 2 blocks, one on top of the other."
      },
      {
        "type": "paragraph",
        "text": "Add buttons to these blocks."
      },
      {
        "type": "paragraph",
        "text": "Result: a nice compact fridge! When you press one of the buttons, the door opens and one of the dispensers launches food out, then the door closes."
      },
      {
        "type": "paragraph",
        "text": "Design 8"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "6 iron blocks",
          "1 iron door",
          "1 pressure plate (not weighted) or 1 lever",
          "1 chest",
          "1 quartz stair (optional)"
        ]
      },
      {
        "type": "paragraph",
        "text": "Once you pick a spot along a wall where the fridge is going to go, dig a two-block deep hole and place one iron block at the bottom of it. Next, put the chest inside that hole, then destroy the three blocks behind, left, and right of the chest. replace those blocks with iron blocks. Next, place an iron block two spaces up (if you place a solid block directly on top of the chest it won't open, therefore, make one space between the chest and the iron block). Optional: At this point, you can place an upside-down quartz stair on the iron block. Since the quartz stair is not a solid block, the chest can still be accessed. However, the quartz stair will not match the iron blocks, so they may need to be replaced by quartz blocks, but they will still not match the iron door. If you do not plan to use the quartz stair, place an iron block on top of the iron block behind the chest."
      },
      {
        "type": "paragraph",
        "text": "Next, jump on top of the iron block (which should only be two spaces above ground) and place the iron door in front of the iron block, making the door and the block touch. Jump down and place the pressure plate in front of the door, or place the lever on the side of the iron block. You will notice that on each side of the fridge there are holes, just places things next to it (i.e. walls, wood planks, crafting tables, etc.). Now you are done, you can put perishable foods in the chest like milk or eggs."
      },
      {
        "type": "paragraph",
        "text": "Design 9"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2 iron blocks",
          "1 stone button"
        ]
      },
      {
        "type": "paragraph",
        "text": "Place the iron into a 1×2 rectangle, then put the button on the top block. There you have it. A simple and pretty decorative fridge. It looks chunky, but it's still pretty cool."
      },
      {
        "type": "paragraph",
        "text": "Design 10"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2/3 iron doors",
          "1 stone slab",
          "1 chest",
          "1 stone button"
        ]
      },
      {
        "type": "paragraph",
        "text": "Depending on where you want your fridge, place the first iron door on the inner side of a block to the left or right of where you want your fridge. Then place the other iron door on the other side, leaving one blank block in between. Third, place your chest, and the last door in front of the chest. On top, place the stone slab. Finally place the button so you can open one of the 3 doors, whichever works for your room layout. To make a corner fridge with this method, you will only need 2 iron doors, with the layout like so:"
      },
      {
        "type": "text",
        "text": "* S * * C D BD *"
      },
      {
        "type": "paragraph",
        "text": "Design 11"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 iron door",
          "8 iron blocks (you can use snow too)",
          "1 lever",
          "1 daylight sensor"
        ]
      },
      {
        "type": "paragraph",
        "text": "Find a place in your wall where you would like to put your fridge (NOTE: this must be at least 2 blocks away from anything you don't want to dig into). Dig into your wall 3 at eye level and 2 deep on the bottom. Dig behind your wall 2 wide."
      },
      {
        "type": "paragraph",
        "text": "After following these instructions, your wall should look like this from overhead:"
      },
      {
        "type": "paragraph",
        "text": "Next, you will start placing your blocks."
      },
      {
        "type": "paragraph",
        "text": "Place two-high iron blocks in all of your empty spaces minus the two in the middle."
      },
      {
        "type": "paragraph",
        "text": "It should look like this now."
      },
      {
        "type": "paragraph",
        "text": "Now, place a block in the middle of all of your iron blocks (note that the one in the middle is lower than the others)."
      },
      {
        "type": "paragraph",
        "text": "Finally, put a daylight sensor on top of that block, a door in front, and a lever on the wall next to that."
      },
      {
        "type": "paragraph",
        "text": "Tip: The daylight sensor can be clicked once to make it look like a freezer pack. Or, if you want to leave your fridge door open and click it again, it will look like you're letting the cold air out and you need to refreeze your freezer packs."
      },
      {
        "type": "paragraph",
        "text": "Design 12"
      },
      {
        "type": "paragraph",
        "text": "Materials:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 iron door",
          "1 iron block",
          "1 rail",
          "1 minecart with chest",
          "1 lever"
        ]
      },
      {
        "type": "paragraph",
        "text": "First, place the iron block on the wall 2 blocks above the floor. Place the rail under the iron block, then put the minecart on the rail back into the fridge. Look down, place the door, then place the lever next to it. Now, you have a nice looking fridge!"
      },
      {
        "type": "paragraph",
        "text": "So functional due to minecarts with chests not needing a free space above it to open it."
      },
      {
        "type": "paragraph",
        "text": "Note: this looks best with counters on the sides."
      },
      {
        "type": "paragraph",
        "text": "Design 13"
      },
      {
        "type": "figure",
        "images": [
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/74/Minecraft_Refrigerator.png/revision/latest/scale-to-width-down/180?cb=20210208045129",
            "alt": "Minecraft Refrigerator",
            "title": ""
          },
          {
            "type": "image",
            "src": "https://static.wikia.nocookie.net/minecraft_gamepedia/images/7/74/Minecraft_Refrigerator.png/revision/latest/scale-to-width-down/180?cb=20210208045129",
            "alt": "Minecraft Refrigerator",
            "title": ""
          }
        ],
        "caption": ""
      },
      {
        "type": "paragraph",
        "text": "Design 13 should look somewhat like this when finished"
      },
      {
        "type": "paragraph",
        "text": "Materials"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 hopper",
          "1 button",
          "2 blocks of iron",
          "1 dispenser or dropper"
        ]
      },
      {
        "type": "paragraph",
        "text": "Wherever you want a fridge, dig a 2-block-across hole (1 block down). On the far end of the hole, put a dispenser/dropper facing you. On the inside of the hole, put a hopper that goes into the dispenser/dropper. Next, put 2 blocks of iron on top of the dispenser/dropper and put a button on the lower iron block. The finished fridge should look like this:"
      },
      {
        "type": "paragraph",
        "text": "To get some food from the fridge, press the button and the dispenser/dropper will drop food at your feet. To put food in your fridge, put the food in the hopper using whatever method."
      },
      {
        "type": "paragraph",
        "text": "Design 14, made by Logan5123"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "1 Redstone",
          "2 of any block, quartz looks the best",
          "1 button",
          "1 iron door",
          "2 dispensers"
        ]
      },
      {
        "type": "paragraph",
        "text": "First, place your two dispensers on top of each other. Fill the dispensers with food, Then, to the exact left/right block depending on where you are placing it, put the Redstone. Then, in front of the Redstone, stack the blocks and put a button on the bottom block. Place the iron door in front of the dispensers. If you click the button, food comes out and the door closes."
      },
      {
        "type": "paragraph",
        "text": "’’’ Design 15, made by Mimiengland’’’"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "2 iron trapdoor",
          "2 dispensers",
          "2 Stone buttons"
        ]
      },
      {
        "type": "paragraph",
        "text": "Place one dispenser on the floor and the second one on top, place the trapdoors on the dispenser. Place both buttons on both dispensers. Now you have a freezer and a refrigerator."
      }
    ]
  },
  {
    "name": "Cupboards",
    "id": "Cupboards",
    "heading_level": 3,
    "hierarchy": [
      "Kitchen",
      "Cupboards"
    ],
    "category": "Kitchen",
    "subcategory": null,
    "parent_section": "Kitchen",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "All you need is a bookshelf and trapdoor. Place down a bookshelf (preferably next to a fridge or furnace) and on the side of the bookshelf facing you place a trapdoor and close it. Now it looks like a bunch of boxes of food or colored cups in a cupboard when you open the trapdoor."
      },
      {
        "type": "paragraph",
        "text": "You can also do it this way: You Need: 2 stairs 2 trap doors Place the 2 stairs inward so it looks like a U. Then place a trapdoor in front of each of the stairs. Now you have a simple but cute looking cabinet."
      },
      {
        "type": "paragraph",
        "text": "The method from RastaPastaWolf: Use a shulker box in any color. Place on the wall so it opens out toward you. Place a trap door so when closed it covers the box. The boxes can then only be opened when the trap door is open, and you can store items in the boxes. So real cupboards!"
      },
      {
        "type": "paragraph",
        "text": "You could also put barrels horizontally. This frees up space AND allows you to put stuff like item frames (plates) or sea pickles (cups) for washing on top!"
      }
    ]
  },
  {
    "name": "Stove",
    "id": "Stove",
    "heading_level": 3,
    "hierarchy": [
      "Kitchen",
      "Stove"
    ],
    "category": "Kitchen",
    "subcategory": null,
    "parent_section": "Kitchen",
    "content_blocks": [
      {
        "type": "text",
        "text": "Design 1"
      },
      {
        "type": "paragraph",
        "text": "take two smokers/furnaces and put them side-by-side. Then, in front of each, put any trapdoor (preferably spruce) and close them. Last, put a carpet (aesthetic) or a campfire (functional) on top of both. A campfire functions!"
      },
      {
        "type": "text",
        "text": "Design 2"
      },
      {
        "type": "paragraph",
        "text": "Place the furnace at a 2 by 2 arrangement. Crouch down and place iron pressure plates on top of all furnaces."
      },
      {
        "type": "text",
        "text": "Design 3"
      },
      {
        "type": "paragraph",
        "text": "Again two smokers/furnaces side-by-side. then on top, shift place detector rails as burners, for a gas stove."
      }
    ]
  },
  {
    "name": "Bathroom",
    "id": "Bathroom",
    "heading_level": 2,
    "hierarchy": [
      "Bathroom"
    ],
    "category": "Bathroom",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Most nicely built bathrooms have some kind of tiles for the floor. Slabs can help you save time and resources if you're in survival. Quartz looks attractive in bathrooms as they add a clean, polished feel and can be chiseled into different styles. You can even make bathrooms with running water, but these would mainly serve as decorations since you (hopefully) can't actually take a bath or use the toilet. Technically, any small room with an infinite water source and a door, qualifies as a \"water closet\". However, here are some ways to build fixtures that can be used for disposal and/or decoration."
      }
    ]
  },
  {
    "name": "Toilet",
    "id": "Toilet",
    "heading_level": 3,
    "hierarchy": [
      "Bathroom",
      "Toilet"
    ],
    "category": "Bathroom",
    "subcategory": null,
    "parent_section": "Bathroom",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Place a hopper then put a trapdoor on it, then you put a lever by the side. Now you have a realistic toilet! Or, take a cauldron, place it, then take an iron trapdoor, put that on top of the cauldron, and then place a button near the trapdoor."
      }
    ]
  },
  {
    "name": "Shower",
    "id": "Shower",
    "heading_level": 3,
    "hierarchy": [
      "Bathroom",
      "Shower"
    ],
    "category": "Bathroom",
    "subcategory": null,
    "parent_section": "Bathroom",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "You can place slabs on the ground to mark off the edges of the shower. This should usually be built in a corner. Then place a piston in the ceiling or wall and place water behind it. You can use a lever to turn the shower on and off."
      },
      {
        "type": "paragraph",
        "text": "Another version is that if you make a wall around 3×3 blocks and put holes in the roof and cover them with glass or trapdoors and then every time it rains if you open them you can have a nice shower."
      },
      {
        "type": "paragraph",
        "text": "Another option is to do what it says in the paragraph above this one but don't make holes in the ceiling. This is the easiest and quickest option but you won't have a functional, water-spewing shower. The reason for this option is purely for decoration and you would not be able to use it."
      },
      {
        "type": "paragraph",
        "text": "However, placing a water source above the ceiling (with particles on) will solve the above problem, because the water will make little blue drops (purely for decoration) that fall from the ceiling, making the shower actually \"work\" in all weathers and without one huge torrent of water that looks pretty unrealistic (have you ever seen a shower that looks like a waterfall?)."
      },
      {
        "type": "paragraph",
        "text": "Another design involves using a dispenser filled with splash water bottles and a clock circuit to create a more advanced shower which will spray water when turned on. For aesthetic purposes, you can also place a tripwire hook or lever on top of the dispenser's opening."
      },
      {
        "type": "paragraph",
        "text": "You can also use a repeating command block with the command \"/summon splash_potion shower x, shower y, shower z.\" You then will need to place a lever on the block adjacent to the command block. Flicking the lever will create a large current of Splash Water Bottles, and the particles produced will create a rain-like effect."
      }
    ]
  },
  {
    "name": "Bath",
    "id": "Bath",
    "heading_level": 3,
    "hierarchy": [
      "Bathroom",
      "Bath"
    ],
    "category": "Bathroom",
    "subcategory": null,
    "parent_section": "Bathroom",
    "content_blocks": [
      {
        "type": "text",
        "text": "Design 1"
      },
      {
        "type": "paragraph",
        "text": "Use a fence, wall or block and surround a 2×1 area near a wall. Get a dispenser and place it in the wall near a button (or lever if you want it to look more like a tap) and place a water bucket into the dispenser, when you hit the button/lever the water will come out and if you hit again it will clear the water out."
      },
      {
        "type": "text",
        "text": "Design 2"
      },
      {
        "type": "paragraph",
        "text": "Repeat the 1st sentence of Design 1, then fill the space with water, add lever or tripwire hook for a tap. Feel free to change the size of the space where the water is but this size is suitable for an average-sized bathroom."
      },
      {
        "type": "text",
        "text": "Design 3"
      },
      {
        "type": "paragraph",
        "text": "You can simply place a minecart down and sit in it to save time."
      },
      {
        "type": "paragraph",
        "text": "Design 4 Dig a 2×2 hole and fill it with water. Surround the water with iron blocks, quartz blocks or white wool. If in Creative, you can use lingering splash potions for the effect of bath scents."
      },
      {
        "type": "paragraph",
        "text": "Design 5 make a border for the bath dig down so it is 2 blocks deep place soul sand on the bottom layer, add water to make a nice bubble bath"
      },
      {
        "type": "paragraph",
        "text": "You could also combine most of these with a birch boat in the middle to be able to sit in it!"
      }
    ]
  },
  {
    "name": "Sink and mirror",
    "id": "Sink_and_mirror",
    "heading_level": 3,
    "hierarchy": [
      "Bathroom",
      "Sink and mirror"
    ],
    "category": "Bathroom",
    "subcategory": null,
    "parent_section": "Bathroom",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "For the sink, you can use a hopper, a cauldron (full or empty), or a minecart (try the rail removal trick from above)."
      },
      {
        "type": "paragraph",
        "text": "For a tap, you can use an item frame and place it above the cauldron. Then place a piece of blue concrete in the item frame. It may not seem like much but now you can turn the \"tap\"."
      },
      {
        "type": "paragraph",
        "text": "You can make an acceptable looking sink and mirror combination by making a section at least 3 blocks wide of your floor material. In the middle block place your chosen sink. Surround the left and right sides of the sink with your wall material as well as the back at least 2 blocks high. Replace the block that is behind and above the sink with your \"mirror\". If you have it, you can use ice, otherwise use a glass pane and completely surround it with wall blocks to make it a full pane. You might put a water block behind the glass, just for \"atmosphere\"."
      },
      {
        "type": "paragraph",
        "text": "A lever or trip-wire hook can be added above the cauldron sink, as a faucet. Also, for an extra touch, you can put up a banner next to your sink to create a towel! (Plain white banners work best, though patterned ones look nice, too.)"
      },
      {
        "type": "paragraph",
        "text": "An alternate mirror is an item frame with the Steve mob head in it, or you can mine a 2 block deep hole in the wall, place a Steve mob head, then place a glass block at the front. (This is only an accurate reflection if you're using the default Steve skin, but if you use the command /give @p skull 1 3 {SkullOwner:PlayerName}, you can get a head with your skin to use.) You can also use a banner, which the pattern follows:"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Light blue base",
          "White base gradient",
          "White bend sinister",
          "Brown bordure"
        ]
      }
    ]
  },
  {
    "name": "Games room",
    "id": "Games_room",
    "heading_level": 2,
    "hierarchy": [
      "Games room"
    ],
    "category": "Games room",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": []
  },
  {
    "name": "Chessboard or checkerboard",
    "id": "Chessboard_or_checkerboard",
    "heading_level": 3,
    "hierarchy": [
      "Games room",
      "Chessboard or checkerboard"
    ],
    "category": "Games room",
    "subcategory": null,
    "parent_section": "Games room",
    "content_blocks": []
  },
  {
    "name": "Simple (recommended) design",
    "id": "Simple_.28recommended.29_design",
    "heading_level": 4,
    "hierarchy": [
      "Games room",
      "Chessboard or checkerboard",
      "Simple (recommended) design"
    ],
    "category": "Games room",
    "subcategory": "Chessboard or checkerboard",
    "parent_section": "Chessboard or checkerboard",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a chess/checkerboard, place a note block anywhere to form the table and board. You can build any type of chairs you like for the table. Notice how the note block looks a lot like a chess/checkerboard. You can cover up the sides with trapdoors for a table effect."
      },
      {
        "type": "paragraph",
        "text": "Note: This may not work with alternate resource packs."
      }
    ]
  },
  {
    "name": "Design 2",
    "id": "Design_2",
    "heading_level": 4,
    "hierarchy": [
      "Games room",
      "Chessboard or checkerboard",
      "Design 2"
    ],
    "category": "Games room",
    "subcategory": "Chessboard or checkerboard",
    "parent_section": "Chessboard or checkerboard",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Note: Make this in a snowy biome."
      },
      {
        "type": "paragraph",
        "text": "Dig a 1 deep hole in the ground. Add two layers of snow. Put an armor stand there (preferable to make next to a wall). Put a chainmail helmet on the stand. Then, using a piston, push a block of quartz down until it reaches ground level. It should now look like a chessboard."
      }
    ]
  },
  {
    "name": "Alternate (overkill) design",
    "id": "Alternate_.28overkill.29_design",
    "heading_level": 4,
    "hierarchy": [
      "Games room",
      "Chessboard or checkerboard",
      "Alternate (overkill) design"
    ],
    "category": "Games room",
    "subcategory": "Chessboard or checkerboard",
    "parent_section": "Chessboard or checkerboard",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "If you are a perfectionist and have the time and resources, you could also do this:"
      },
      {
        "type": "list",
        "style": "ordered",
        "items": [
          "Get a map",
          "get any two colors of blocks (preferably white and black)",
          "put the map in your off-hand",
          "go somewhere out in the open “away from your house”",
          "Make the map",
          "build a checkerboard pattern so that you can see it on the map",
          {
            "type": "list",
            "style": "ordered",
            "items": [
              "Name banners of each color after chess/checkers pieces",
              "put them where you think the pieces should be at the point in the game",
              "click the map onto each banner"
            ]
          },
          {
            "type": "list",
            "style": "ordered",
            "items": [
              "craft the map with glass on a cartography table",
              "Optional: destroy the checkerboard design"
            ]
          },
          "Put an item frame on the thing you wanted a chessboard on",
          "put the map in the frame"
        ]
      },
      {
        "type": "paragraph",
        "text": "You can then clone the map to simplify the process and skip to step 9."
      },
      {
        "type": "paragraph",
        "text": "Notes: To fill the entire map, you will need 64 16x16 squares, 32 white and 32 black."
      },
      {
        "type": "paragraph",
        "text": "This process can be made much easier with Structure Blocks."
      }
    ]
  },
  {
    "name": "Pool table",
    "id": "Pool_table",
    "heading_level": 3,
    "hierarchy": [
      "Games room",
      "Pool table"
    ],
    "category": "Games room",
    "subcategory": null,
    "parent_section": "Games room",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Put down 3×6 dark green wool blocks, with closed trapdoors for sides. Or, you can put down wood planks and cover them with green or lime carpet. Use fence posts to 'suspend' three jack o'lanterns in a row a single space above the table (will require temporary blocks to sit them on, then destroy them after the pumpkins are placed). Ideally, have faces turned in against each other. Then use string to draw a balking line across the second row of green blocks. Nearby you can have a chest with sticks, eggs and the oblong dyes (e.g.: lime, pink and purple)."
      }
    ]
  },
  {
    "name": "Ping pong table",
    "id": "Ping_pong_table",
    "heading_level": 3,
    "hierarchy": [
      "Games room",
      "Ping pong table"
    ],
    "category": "Games room",
    "subcategory": null,
    "parent_section": "Games room",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Lay down 5×3 wooden slabs. At the two long ends, make a 3×1 fence. Cover the whole lot in green carpet/rug. In the middle of the long sides and at the side, place 3 high wooden blocks, with tripwire hooks on the inside of the top blocks, connected by string for the net. Cobwebs might work here as well. But you may not be able to get the green carpet in that case just use green wool."
      }
    ]
  },
  {
    "name": "Pac-Man arcade cabinet",
    "id": "Pac-Man_arcade_cabinet",
    "heading_level": 3,
    "hierarchy": [
      "Games room",
      "Pac-Man arcade cabinet"
    ],
    "category": "Games room",
    "subcategory": null,
    "parent_section": "Games room",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "A simple way is to place two stairs, one on the ground, and one on top of it, upside down. Another way is to put 2 yellow wool (gold blocks work as well), one on the ground, put glass on top of it, and the other wool block on top. Put a painting (or an item frame map) on the glass, and you're done! You can also put two gold blocks on the ground, next to each other, put black wool on one of the blocks, put another gold block on top of it, and put white wool in front of it. Put a lever on the gold block on the ground to act as a joystick (Rails and crafting /tic-tac-toe tables work too) and you have a decent looking Pac-Man machine!"
      }
    ]
  },
  {
    "name": "Miscellaneous",
    "id": "Miscellaneous",
    "heading_level": 2,
    "hierarchy": [
      "Miscellaneous"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "This section is for pieces of furniture that really don't fit in any categories listed above."
      }
    ]
  },
  {
    "name": "Water spigot",
    "id": "Water_spigot",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Water spigot"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Use this if you're making an outside enclosure for your farm animals. It looks nice and is refillable with rain water."
      },
      {
        "type": "paragraph",
        "text": "First put a 3×3 base of cobblestone. Then place a cobblestone wall on top of the middle cobblestone. Then place a lever and Tripwire Hook on opposite sides of a chiseled stone block. Add a Cauldron under the Tripwire Hook, and there you go a sort of working water spigot!"
      },
      {
        "type": "paragraph",
        "text": "Water Spigot"
      }
    ]
  },
  {
    "name": "Pet door",
    "id": "Pet_door",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Pet door"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "A pet door is actually quite simple to create and will save you the trouble of having to keep the door open for your pets, such as wolves. To make a pet door make a 1×1 hole in the wall then put pressure plates on both sides of the hole. Inside the hole, put in a fence gate. Now your pets can come in with ease and most monsters won't be able to get in (except for cave spiders, silverfish, and the small slimes)!"
      }
    ]
  },
  {
    "name": "Radio",
    "id": "Radio",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Radio"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Basically, all you need are 2 note blocks and an Iron block. First, place the note blocks. Make sure you have a 1 block gap between them. Then, place the iron block in the gap. You could even place buttons or redstone torches on the blocks to give the feel of having knobs and an antenna or replace one block with a jukebox to play music."
      }
    ]
  },
  {
    "name": "Fancy jukebox",
    "id": "Fancy_jukebox",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Fancy jukebox"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "For this, you will need 4 stair blocks, a jukebox, and a redstone lamp. Optional items are a chest, 2 more stair blocks, a slab, and maybe a few buttons for decoration. First, place the redstone lamp on the floor with the jukebox on top. Then, place two stairs next to the redstone lamp, then place the other two stairs on top of the stairs so it makes a [ shape. If you have buttons, add them where you would like, then place the music disk inside the jukebox! If you are using the chest, place the chest on top of it and add on the other two stair blocks next to the chest on top of the previously placed stairs. Then, put the slab right above the chest (don't worry, the chest will still open)."
      }
    ]
  },
  {
    "name": "Redstone",
    "id": "Redstone",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Redstone"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Try using Redstone to \"deploy\" furniture. You can even try to make a barren room with everything hidden, with a lever that reveals or creates furniture. This may sound weird, however, it has a cool effect when you actually use it. To do this, you use pistons along the walls, and pull them back with the flick of a lever to reveal your furniture!"
      },
      {
        "type": "paragraph",
        "text": "Put furniture where the wood slabs are."
      }
    ]
  },
  {
    "name": "Maps",
    "id": "Maps",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Maps"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Maps can be useful, or merely decorative."
      }
    ]
  },
  {
    "name": "Wall map",
    "id": "Wall_map",
    "heading_level": 4,
    "hierarchy": [
      "Miscellaneous",
      "Maps",
      "Wall map"
    ],
    "category": "Miscellaneous",
    "subcategory": "Maps",
    "parent_section": "Maps",
    "content_blocks": [
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "1 item frame",
              "1 map"
            ]
          }
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "To cover a larger area, place more item frames and maps in a grid-like structure."
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Floor or table map",
    "id": "Floor_or_table_map",
    "heading_level": 4,
    "hierarchy": [
      "Miscellaneous",
      "Maps",
      "Floor or table map"
    ],
    "category": "Miscellaneous",
    "subcategory": "Maps",
    "parent_section": "Maps",
    "content_blocks": [
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "1 sticky piston",
              "1 redstone torch OR 4 pressure plates"
            ]
          }
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Once again, to cover a larger area, place more torches and sticky pistons in a grid-like structure. (can't use pressure plates for this) You can also use normal pistons to simulate large tracts of ocean.",
              "You can actually put this on the wall, however, if you do, you shouldn't power the pistons."
            ]
          }
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Only for decoration; serves no other purpose.",
              "May not work in some Resource packs"
            ]
          }
        ]
      }
    ]
  },
  {
    "name": "Wall clock",
    "id": "Wall_clock",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Wall clock"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "All you really have to do is place a clock into an item frame and hang it up. Now you can have a wall clock in your house or anywhere you'd like to place it!"
      }
    ]
  },
  {
    "name": "Classical clock",
    "id": "Classical_clock",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Classical clock"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "Take two of any block you want (you must be able to put an item frame on it!), place one of the blocks on the floor, and then place the other one on top of the block. Add an item frame with a clock on the top block and you're done! Something optional you could do is to add an item frame on the bottom block with a spade/shovel in it, rotated to be the pendulum."
      }
    ]
  },
  {
    "name": "Grill",
    "id": "Grill",
    "heading_level": 3,
    "hierarchy": [
      "Miscellaneous",
      "Grill"
    ],
    "category": "Miscellaneous",
    "subcategory": null,
    "parent_section": "Miscellaneous",
    "content_blocks": [
      {
        "type": "paragraph",
        "text": "To make a barbecue on the patio or outside of your house, you can craft an anvil and place it where you want on your outdoor space."
      }
    ]
  },
  {
    "name": "Videos",
    "id": "Videos",
    "heading_level": 2,
    "hierarchy": [
      "Videos"
    ],
    "category": "Videos",
    "subcategory": null,
    "parent_section": null,
    "content_blocks": [
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Menu screen",
          "Game terms"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "The first day/beginner's guide",
          "The second day",
          "The third day",
          "Hunger management",
          "Things not to do",
          "Simple tips and tricks",
          "Your first ten minutes"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Best biomes for homes",
          "Best building materials",
          "Building and construction",
          "Navigation",
          "Shelters",
          "Shelter types"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Newcomer survival",
            ""
          ],
          [
            "Shelters",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "General"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Achievement guide",
          "Advancement guide",
          "Best enchantments guide",
          "Breaking bedrock",
          "Combat",
          "Complete main adventure",
          "Creating a village",
          "Downgrading",
          "Dual wielding",
          "End survival",
          "Exploring caverns",
          "Gathering resources on peaceful difficulty",
          "Getting food quickly",
          "Headless pistons",
          "Hitboxes",
          "Horses",
          "Indestructible end crystals",
          "Mapping",
          "Measuring distance",
          "Minecraft in education",
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Diamonds",
              "Fossils",
              "Ancient Debris"
            ]
          },
          "Nether hub",
          "Nether portals",
          "Nether survival",
          "Organization",
          "Pillar jumping",
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "PvP bases"
            ]
          },
          "Spawn-proofing",
          "Summoning jockeys",
          "The Void",
          "Time-saving tips",
          "Thunderstorm survival",
          "Units of measure",
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Trading"
            ]
          },
          "X-ray glitches"
        ]
      },
      {
        "type": "text",
        "text": "Challenges"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Acquiring a conduit",
          "Curing a zombie villager",
          "Defeating temples",
          "Defeating a village raid",
          "Defeating a Nether fortress",
          "Defeating a bastion remnant",
          "Defeating a monster room",
          "Defeating a pillager outpost",
          "Defeating a woodland mansion",
          "Defeating a monument",
          "Defeating an End city",
          "Defeating the Ender dragon",
          "Defeating the Wither",
          "Exploring an ancient city",
          "Obtaining every music disc"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Adventure survival",
          "Half hearted hardcore",
          "Hardcore mode",
          "Surviving in a single area indefinitely",
          "Infinite desert survival",
          "Island survival",
          "Manhunt",
          "Mob switch",
          "Nomadic experience",
          "Skywars survival",
          "Superflat survival",
          "Flat survival",
          "Ultra hardcore survival"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Beating a challenge map",
          "Creating a challenge map"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Non-standardsurvival",
            ""
          ],
          [
            "Challenge maps",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Constructions"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Adding beauty to constructions",
          "Airlock",
          "Architectural terms",
          "Building a cruise ship",
          "Building a metropolis",
          "Building a rollercoaster",
          "Building safe homes",
          "Building water features",
          "Color palette",
          "Creating shapes",
          "Defense",
          "Desert shelter",
          "Elevators",
          "Endless circling pool",
          "Furniture",
          "Glazed terracotta patterns",
          "Making nice floors",
          "Pixel art",
          "Ranches",
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Curved roofs",
              "Roof construction guidelines",
              "Roof decorations"
            ]
          },
          "Secret door",
          "Settlement guide",
          "Underwater home",
          "Walls and buttresses",
          "Water gate",
          "Water-powered boat transportation"
        ]
      },
      {
        "type": "text",
        "text": "Farming"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Amethyst",
          "Armor",
          "Azalea",
          "Bamboo",
          "Basalt",
          "Bedrock",
          "Blaze rod",
          "Bone meal",
          "Cactus",
          "Chorus fruit",
          "Clay and mud",
          "Cobblestone",
          "Cocoa bean",
          "Copper",
          "Crops (Beetroot, Carrot, Potato, Wheat)",
          "Dirt",
          "Dragon's breath",
          "Dripstone",
          "Egg",
          "Fern",
          "Fish",
          "Flower",
          "Froglight",
          "Glow berries",
          "Glow ink sac",
          "Glow lichen",
          "Goat horn",
          "Gold",
          "Hanging roots",
          "Honey",
          "Ice",
          "Iron",
          "Kelp",
          "Lava",
          "Meat",
          "Moss block",
          "Mushroom",
          "Music disc",
          "Nautilus shell",
          "Nether growth",
          "Nether vine",
          "Nether wart",
          "Obsidian",
          "Powder snow",
          "Pumpkin, Melon",
          "Rooted dirt",
          "Sculk growths",
          "Scute",
          "Seagrass",
          "Sea pickle",
          "Snow",
          "Soul soil",
          "Sugar cane",
          "Sweet berries",
          "Tree",
          "Trident",
          "Vine",
          "Villager trading hall",
          "Wither rose",
          "Wool",
          "Duplication"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Mob farming",
          "Mob grinding",
          "Monster spawner traps",
          "Allay",
          "Animals",
          "Axolotl",
          "Blaze",
          "Cat",
          "Cave spider",
          "Creeper",
          "Drowned",
          "Ender dragon",
          "Enderman",
          "Frog",
          "Goat",
          "Guardian",
          "Hoglin",
          "Iron golem",
          "Magma cube",
          "Phantom",
          "Piglin bartering farm",
          "Raid",
          "Shulker",
          "Slime",
          "Squid",
          "Turtle",
          "Villager",
          "Wandering trader",
          "Warden",
          "Witch",
          "Wither",
          "Wither skeleton",
          "Zombie",
          "Zombie villager",
          "Zombified piglin"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "End of light mob farms"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Blocks and items",
            ""
          ],
          [
            "Mobs",
            ""
          ],
          [
            "OP farms",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Enchanting"
      },
      {
        "type": "text",
        "text": "and"
      },
      {
        "type": "text",
        "text": "smelting"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Enchantment mechanics",
          "Anvil mechanics",
          "Automatic smelting",
          "Manual smelting"
        ]
      },
      {
        "type": "text",
        "text": "Blockbreaking"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Blast chamber",
          "Igniting TNT underwater",
          "Wither cage"
        ]
      },
      {
        "type": "text",
        "text": "Mechanisms"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Automatic respawn anchor recharger",
          "Basic logic gates",
          "Combination locks",
          "Command block",
          "Flying machines",
          "Hopper",
          "Item sorting",
          "Item transportation",
          "Mechanisms",
          "Observer stabilizer",
          "Randomizers",
          "Redstone music",
          "Redstone tips",
          "Rube Goldberg machine",
          "Shulker box storage",
          "Villager trading hall"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Block update detector",
          "Comparator update detector",
          "Daylight sensor",
          "Day night detector"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Train station",
          {
            "type": "list",
            "style": "unordered",
            "items": [
              "Storage",
              "Storage system"
            ]
          }
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Snow golems",
          "TNT cannons",
          "Trapdoor uses",
          "Trap design",
          "Traps"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Piston uses",
          "Piston circuits",
          "Quasi-connectivity",
          "Zero-ticking",
          "Instant repeaters"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Advanced redstone circuits",
          "Arithmetic logic",
          "Calculator",
          "Command stats",
          "Hourly clock",
          "Morse code",
          "Printer",
          "Redstone computers",
          "Redstone telegraph"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Basic redstone",
            ""
          ],
          [
            "Detectors",
            ""
          ],
          [
            "Minecarts",
            ""
          ],
          [
            "Traps",
            ""
          ],
          [
            "Pistons",
            ""
          ],
          [
            "Advancedredstone",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Servers"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Playing on servers",
          "Multiplayer Survival",
          "Spawn jail",
          "Griefing prevention",
          "Joining a LAN world with alternate accounts"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Setting up a server",
          "Server startup script",
          "FreeBSD startup script",
          "OpenBSD startup script",
          "Ubuntu startup script",
          "Setting up a Hamachi server",
          "Setting up a Minecraft Forge server",
          "Setting up a Spigot server",
          "Ramdisk enabled server"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Server setup",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Technical"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Improving frame rate",
          "Minecraft help FAQ (IRC channel)",
          "Update Java"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Custom maps",
          "Map downloads",
          "Command NBT tags",
          "Falling blocks",
          "Updating old terrain using MCEdit"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Creating a resource pack",
          "Loading a resource pack",
          "Sound directory"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Creating a data pack",
          "Installing a data pack",
          "Custom world generation"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Creating videos",
          "Livestreaming"
        ]
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Installing snapshots",
          "Joining and leaving the Bedrock Edition beta program",
          "How to get a crash report",
          "Installing Forge mods",
          "Custom Minecraft directory",
          "Playing and saving Minecraft on a thumb drive",
          "Playing and saving Minecraft on a thumb drive with the old launcher",
          "Recover corrupted saved world data",
          "Run Minecraft through Google Drive",
          "Save game data to Dropbox (world data only)",
          "Saved data Dropbox guide"
        ]
      },
      {
        "type": "table",
        "rows": [
          [
            "Maps",
            ""
          ],
          [
            "Resource packs",
            ""
          ],
          [
            "Data packs",
            ""
          ],
          [
            "CreatingMinecraft media",
            ""
          ],
          [
            "Game installation",
            ""
          ]
        ]
      },
      {
        "type": "text",
        "text": "Outdated"
      },
      {
        "type": "list",
        "style": "unordered",
        "items": [
          "Building micro shelters",
          "Custom texture packs",
          "Door-based iron golem farming",
          "Far Lands",
          "How to get a crash report",
          "Installing mods",
          "Man-made lake",
          "Managing slimes in superflat mode",
          "Minecart booster",
          "Potion farming",
          "Repeater reboot system",
          "Survival with no enabled data packs",
          "Update LWJGL",
          "Update Minecraft",
          "Village chaining",
          "Water ladder",
          "Water tram"
        ]
      }
    ]
  }
]